       01 DataRec.
          88 EndOf-:tag: value high-values.
          02 DistrictId-:tag:.
             03 StateId-:tag: pic 99.
             03 FILLER pic 999.
          02 Date-:tag:.
             03 Year-:tag: pic 9999.
             03 Month-:tag: pic 99.
             03 Day-:tag: pic 99.
          02 Cases-:tag: pic 9(6).
